app/controllers/cats_controller.rb

  def create
      @cat = Cat.new(cat_params)
      if @cat.save
---
INSERT INTO "cats" ("name", "life_story", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "cats" SET "image_url" = $1, "updated_at" = $2 WHERE "cats"."id" = $3